Revit 2027 API
ConicalSurface.HalfAngle Property
 Cone angle.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HalfAngle { get; }
Public ReadOnly Property HalfAngle As Double
	Get
public:
property double HalfAngle {
	double get ();
}
member HalfAngle : float with get
Property Value
Double
See Also
Reference
ConicalSurface Class
Autodesk.Revit.DB Namespace